simform-solutions/NRFmesh-IOT/dht11 nrf52 Nordic Semiconductor.c
NRF_SDH_SOC_OBSERVER(mesh_observer, NRF_SDH_BLE_STACK_OBSERVER_PRIO, on_sd_evt, NULL);

static bool on_off_server_get_cb(const generic_on_off_server_t * p_server)
{
  return m_led_flag;
}

static bool on_off_server_set_cb(const generic_on_off_server_t * p_server, bool value)
{
    // TODO: Hands on 2.3 - After initializing the PWM library in main(), change this function to use the PWM Driver instead of the hal_led_.. functions
    //                      Try to make the LED's fade in and out when the callback occurs, rather than having it set/cleared immediately
    uint32_t err_code;
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Got SET command to %u\n", value);
    if (value)
    {
        hal_led_pin_set(ONOFF_SERVER_0_LED, true);
        m_led_flag = true;
    }
    else
    {
        hal_led_pin_set(ONOFF_SERVER_0_LED, false);
        m_led_flag = false;
    }
    
    return value;
}

static void node_reset(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "----- Node reset  -----\n");
    hal_led_blink_ms(LEDS_MASK, LED_BLINK_INTERVAL_MS, LED_BLINK_CNT_RESET);

    /* This function may return if there are ongoing flash operations. */
    mesh_stack_device_reset();
}

static void config_server_evt_cb(const config_server_evt_t * p_evt)
{
    if (p_evt->type == CONFIG_SERVER_EVT_NODE_RESET)
    {
        node_reset();
    }
}

static bool client_publication_configured(void)
{
    dsm_handle_t pub_addr_handle;
    
    if (access_model_publish_address_get(m_client.model_handle, &pub_addr_handle) == NRF_SUCCESS)
    {
        if (pub_addr_handle == DSM_HANDLE_INVALID)
        {
            return false;
        }
    }
    else
    {
        return false;
    }
    // printf("inside public fn");
    return true;

}

static void button_event_handler(uint32_t button_number)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Button %u pressed\n", button_number);
    /*uint32_t status = client_publication_configured();
    printf("status: %u",status);*/
        if (client_publication_configured())
    {
        uint32_t status = NRF_SUCCESS;
         
        switch (button_number)
        {
            // printf("inside fn");
            /* Pressing SW1 on the Development Kit will result in LED state to toggle and trigger
            the STATUS message to inform client about the state change. This is a demonstration of
            state change publication due to local event. */
            case 0:
            case 1:
                /* send a group message to the ODD group, with flip the current button flag value */
               // m_on_off_button_flag= false;
                 //status = generic_on_off_client_set(&m_client,m_on_off_button_flag);
                status = generic_on_off_client_set_unreliable(&m_client,
                                                           m_on_off_button_flag,
                                                         GROUP_MSG_REPEAT_COUNT);
                                                         
                break;
            
            /* Initiate node reset */
            case 3:
                /* Clear all the states to reset the node. */
                if (mesh_stack_is_device_provisioned())
                {
                    (void) proxy_stop();
                    mesh_stack_config_clear();
                    node_reset();
                }
                else
                {
                    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "The device is unprovisioned. Resetting has no effect.\n");
                }
                break;

            default:
                break;
        }  
    }
    else{
        //printf("Not inside fun");
    }
}

static void app_rtt_input_handler(int key)
{
    //printf("key %d", key);
    if (key >= 0 && key <= 4)
    {
        
        uint32_t button_number = key - 0;
       // printf("key %u", button_number);
        button_event_handler(button_number);
    }
}

static void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
    uint32_t err_code;

    if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
    {
        err_code = sd_ble_gap_disconnect(p_evt->conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
        APP_ERROR_CHECK(err_code);
    }
    else if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_SUCCEEDED)
    {
        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Successfully updated connection parameters\n");
    }
}

static void conn_params_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

static void provisioning_complete_cb(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Successfully provisioned\n");

    /* Restores the application parameters after switching from the Provisioning service to the Proxy  */
    gap_params_init();
    conn_params_init();

    dsm_local_unicast_address_t node_address;
    dsm_local_unicast_addresses_get(&node_address);
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Node Address: 0x%04x \n", node_address.address_start);

    // TODO: Hands on 2.3 - Change the following code to pulse the LED's rather than blink
    //                      Use the LED_BLINK_CNT_PROV to decide the number of pulses
    hal_led_mask_set(LEDS_MASK, false);
    hal_led_blink_ms(LEDS_MASK, LED_BLINK_INTERVAL_MS, LED_BLINK_CNT_PROV);
}

static void client_status_cb(const generic_on_off_client_t * p_self, generic_on_off_status_t status, uint16_t src)
{

    __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR, "server status received \n");
    switch (status)
    {
        case GENERIC_ON_OFF_STATUS_ON:
            m_on_off_button_flag=1;   
            __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR, "set m_on_off_button_flag to 1 \n");
            break;

        case GENERIC_ON_OFF_STATUS_OFF:
            m_on_off_button_flag=0;
            __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR, "set m_on_off_button_flag to 0 \n");
            break;

        case GENERIC_ON_OFF_STATUS_ERROR_NO_REPLY:
            __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR, "GENERIC_ON_OFF_STATUS_ERROR_NO_REPLY \n");
            break;

        case GENERIC_ON_OFF_STATUS_CANCELLED:
        default:
            __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR, "Unknown status \n");
            break;
    }
}
static void client_publish_timeout_cb(access_model_handle_t handle, void * p_self)
{
     __LOG(LOG_SRC_APP, LOG_LEVEL_ERROR, "Acknowledged send timedout\n");
}

