simform-solutions/NRFmesh-IOT/dht11 nrf52 Nordic Semiconductor.c
static void models_init_cb(void)
{
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Initializing and adding models\n");
    m_server.get_cb = on_off_server_get_cb;
    m_server.set_cb = on_off_server_set_cb;
    ERROR_CHECK(generic_on_off_server_init(&m_server, 0));
    ERROR_CHECK(access_model_subscription_list_alloc(m_server.model_handle));
    //Initialize client on model 1
    m_client.status_cb = client_status_cb;
    m_client.timeout_cb = client_publish_timeout_cb;
    ERROR_CHECK(generic_on_off_client_init(&m_client, 1));
    ERROR_CHECK(access_model_subscription_list_alloc(m_client.model_handle));
}

static void mesh_init(void)
{
    uint8_t dev_uuid[NRF_MESH_UUID_SIZE];
    uint8_t node_uuid_prefix[NODE_UUID_PREFIX_LEN] = SERVER_NODE_UUID_PREFIX;

    ERROR_CHECK(mesh_app_uuid_gen(dev_uuid, node_uuid_prefix, NODE_UUID_PREFIX_LEN));
    mesh_stack_init_params_t init_params =
    {
        .core.irq_priority       = NRF_MESH_IRQ_PRIORITY_LOWEST,
        .core.lfclksrc           = DEV_BOARD_LF_CLK_CFG,
        .core.p_uuid             = dev_uuid,
        .models.models_init_cb   = models_init_cb,
        .models.config_server_cb = config_server_evt_cb
    };
    ERROR_CHECK(mesh_stack_init(&init_params, &m_device_provisioned));
}

static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);
}

static void conn_params_init(void)
{
    uint32_t               err_code;
    ble_conn_params_init_t cp_init;
    ble_gap_conn_params_t  gap_conn_params;

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));
    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);

    memset(&cp_init, 0, sizeof(cp_init));
    cp_init.p_conn_params                  = &gap_conn_params;
    cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
    cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
    cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
    cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
    cp_init.disconnect_on_fail             = false;
    cp_init.evt_handler                    = on_conn_params_evt;
    cp_init.error_handler                  = conn_params_error_handler;

    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}

static void initialize(void)
{
    __LOG_INIT(LOG_SRC_APP | LOG_SRC_ACCESS | LOG_SRC_BEARER, LOG_LEVEL_INFO, LOG_CALLBACK_DEFAULT);
    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "----- BLE Mesh Light Switch Proxy Server Demo -----\n");

    ERROR_CHECK(app_timer_init());
    hal_leds_init();

#if BUTTON_BOARD
    ERROR_CHECK(hal_buttons_init(button_event_handler));
#endif
    uint32_t err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

#if defined S140 // todo remove that after S140 priority fixing
    softdevice_irq_priority_checker();
#endif

    uint32_t ram_start = 0;
    /* Set the default configuration (as defined through sdk_config.h). */
    err_code = nrf_sdh_ble_default_cfg_set(MESH_SOFTDEVICE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    gap_params_init();
    conn_params_init();

    mesh_init();
}

static void start(void)
{
    rtt_input_enable(app_rtt_input_handler, RTT_INPUT_POLL_PERIOD_MS);
    ERROR_CHECK(mesh_stack_start());

    if (!m_device_provisioned)
    {
        static const uint8_t static_auth_data[NRF_MESH_KEY_SIZE] = STATIC_AUTH_DATA;
        mesh_provisionee_start_params_t prov_start_params =
        {
            .p_static_data    = static_auth_data,
            .prov_complete_cb = provisioning_complete_cb,
            .p_device_uri = NULL
        };
        ERROR_CHECK(mesh_provisionee_prov_start(&prov_start_params));
    }

    const uint8_t *p_uuid = nrf_mesh_configure_device_uuid_get();
    __LOG_XB(LOG_SRC_APP, LOG_LEVEL_INFO, "Device UUID ", p_uuid, NRF_MESH_UUID_SIZE);
   
     //app_rtt_input_handler(0);
     //unsigned int i=0;
    
    // TODO: Hands on 2.3 - Initialize the simple_pwm library to use the 4 LED's on the devkit
    //                      To verify that the PWM driver works, set one of the LED's to blink or pulse in a loop
    //                      Hint: Look at the comments in simple_pwm.h for examples of how to use the simple_pwm library
    //                      Hint2: The LED's on the board are defined by the BSP_LED_x defines, where x is 0-3

   /* for (;;)
    {
        (void)sd_app_evt_wait();
        i++;
        printf("NO = %d\n", i);
        if(i == 5){
        
        button_event_handler(button_num);

        }
        /*DHT_task_callback();  
        printf("Temp = %d\n",TEMPERATURE_Int);      */       
      // nrf_delay_ms(1000);
    //}
}

void DHT_task_callback(void)
{
                //uint8_t BT_Buff[20],BT_Buff1[20], str[20] = "ADC 1234";
                //uint16_t bytes_to_send = 20;
                ret_code_t err_code;
                //while(1)
                {
                        //while(ble_nus_string_send(&m_nus, str, &bytes_to_send) != NRF_SUCCESS);
                       // NRF_LOG_INFO("get first data\n");
                        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "get first data\n");
                        DHT11_START_SEQUENCE();
                        err = DHT11_READ_5_BYTES_DATA();
                        if(err == 0)
                        {
                                Convert_Humidity_Temperature_Values(Humidity_Int);
                                //NRF_LOG_INFO("Humidity %d\n",(int)Humidity_Int);
                                decimal_value2 = ((decimal_value2&0x0f)|0x30);
                                decimal_value1 = ((decimal_value1&0x0f)|0x30);
                               // NRF_LOG_INFO("humidity = %c%c\n",decimal_value2,decimal_value1);
                                __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "humidity = %c%c\n",decimal_value2,decimal_value1);
                    
                                   // sprintf((char *)BT_Buff,"HUM-%d",Humidity_Int);
                                //while(ble_nus_string_send(&m_nus, BT_Buff, &bytes_to_send) != NRF_SUCCESS);
        
                                //nop();
                                Convert_Humidity_Temperature_Values(TEMPERATURE_Int);
                                //NRF_LOG_INFO("Temperature = %d\n", (int)TEMPERATURE_Int);
                                decimal_value2 = ((decimal_value2&0x0f)|0x30);
                                decimal_value1 = ((decimal_value1&0x0f)|0x30);
                               // NRF_LOG_INFO("temp = %c%c\n",decimal_value2,decimal_value1);
                                //printf("temp = %c%c\n",decimal_value2,decimal_value1);
                               __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "Temp = %d\n",TEMPERATURE_Int);
                                                                                                                    
                                //sprintf((char *)BT_Buff1,"Temp-%d",TEMPERATURE_Int);
                                //strcat(BT_Buff1, BT_Buff);
                                //while(ble_nus_string_send(&m_nus, BT_Buff1, &bytes_to_send) != NRF_SUCCESS);
                                // nop();
                                //ip++;
                                                                }

                     
