simform-solutions/NRFmesh-IOT/dht11 nrf52 Nordic Semiconductor.c
 if(TEMPERATURE_Int >= 25){
       m_on_off_button_flag= true;
              uint32_t button_num = 0;
     button_event_handler(button_num);
     }
     else{
          m_on_off_button_flag= false;
              uint32_t button_num = 0;
     button_event_handler(button_num);
     
     }
                        //nrf_delay_ms(5000);
                }
}


void DHT11_START_SEQUENCE(void)
{
            DHT11_DIR_OUTPUT();

            nrf_gpio_pin_write(DHT11_ONE_WIRE_INPUT_PIN, level_1);
            //DHT11_ONE_WIRE_OUTPUT_PIN = 1;

            nrf_gpio_pin_write(DHT11_ONE_WIRE_INPUT_PIN, level_0);
            nrf_delay_ms(25);
            //ets_delay_us(22000);


            nrf_gpio_pin_write(DHT11_ONE_WIRE_INPUT_PIN, level_1);
            //  Delay_micro_second(30);
                nrf_delay_us(30);


            DHT11_DIR_INPUT();


            Count_micro_second = 0;
            //while(DHT11_ONE_WIRE_INPUT_PIN==0)
            while(nrf_gpio_pin_read(DHT11_ONE_WIRE_INPUT_PIN)==0)
            {

            //  printf("waiting for make line high by dht11\n");
                nrf_delay_us(1);
            }
            test_start_seq2 = Count_micro_second;

            Count_micro_second = 0;
            //  while(DHT11_ONE_WIRE_INPUT_PIN==1)
            while(nrf_gpio_pin_read(DHT11_ONE_WIRE_INPUT_PIN)==1)
            {
                    //printf("waiting for make line low by dht11\n");
                    nrf_delay_us(1);
            }
            test_start_seq3 = Count_micro_second;
}


char DHT11_READ_5_BYTES_DATA(void)
{
                //vTaskSuspendAll ();
                err = 0;
                Humidity_Int = DHT11_READ_1_BYTES_DATA();
                Humidity_DEC = DHT11_READ_1_BYTES_DATA();
                TEMPERATURE_Int = DHT11_READ_1_BYTES_DATA();
                TEMPERATURE_DEC = DHT11_READ_1_BYTES_DATA();
                CHECKSUM = DHT11_READ_1_BYTES_DATA();
//              printf("datas = %c %c\n",Humidity_Int,TEMPERATURE_Int);

                if (((Humidity_Int + Humidity_DEC + TEMPERATURE_Int + TEMPERATURE_DEC) & 0xff) != CHECKSUM) 
                {

                   // NRF_LOG_INFO("got wrong values\n");
                        __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "got wrong values\n");
                    return 1;
                }
                else
                {
                    //NRF_LOG_INFO("got values\n");
                    __LOG(LOG_SRC_APP, LOG_LEVEL_INFO, "got values\n");
                    return err;
                }
}

unsigned char DHT11_READ_1_BYTES_DATA(void)
{

            unsigned int i=0;
            unsigned char Return_Value=0;

            for(i=0;i<8;i++)
            {
                        Return_Value = Return_Value << 1;

                    //printf("inside low");
                    while((nrf_gpio_pin_read(DHT11_ONE_WIRE_INPUT_PIN)) == 0)
                    {
                                    //  printf("inside low");
                                    //NRF_LOG_INFO("inside low1");
                                        nrf_delay_us(5);
                    }
                    Count_micro_second = 0;

                    //printf("inside high");
                    //NRF_LOG_INFO("inside high");
                    while((nrf_gpio_pin_read(DHT11_ONE_WIRE_INPUT_PIN))==1)
                    {
                                Count_micro_second++;
                                nrf_delay_us(5);
                    }

                    if(Count_micro_second<7)
                    {   
                                    
                                    Return_Value = Return_Value | 0;
                    }
                    else
                    {
                                Return_Value = Return_Value | 1;
                    }       
            }
//      printf("return_value=%c\n",Return_Value);

    return Return_Value;

}

void DHT11_DIR_INPUT(void)
{
                nrf_gpio_cfg_input(DHT11_ONE_WIRE_INPUT_PIN, NRF_GPIO_PIN_PULLUP);
}

void DHT11_DIR_OUTPUT(void)
{
                nrf_gpio_cfg_output(DHT11_ONE_WIRE_INPUT_PIN);
                //DHT11_ONE_WIRE_DIR = 1;
}

void Convert_Humidity_Temperature_Values(unsigned char byte1)
{

            unsigned char intermediate_value1=0;                              //Varible required while converting the hex value to decimal value
                /*******************************************************************************
                Procedure to convert 8bit hex value to equivalent BCD value
                *******************************************************************************/
            decimal_value3=(byte1/100);
            intermediate_value1=byte1-(100*decimal_value3);
            decimal_value2=(intermediate_value1/10);
            decimal_value1=intermediate_value1-(10*decimal_value2);
}


int main(void)
{
   
    initialize();
    execution_start(start);
    
    while(1)
    {
        execution_start(DHT_task_callback);   
        (void)sd_app_evt_wait();
        nrf_delay_ms(5000);
    }
}
